Revit 2027 API
ExternalResourceTypes.BuiltInExternalResourceTypes.Image Property
 An external resource type representing images.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ExternalResourceType Image { get; }
Public Shared ReadOnly Property Image As ExternalResourceType
	Get
public:
static property ExternalResourceType^ Image {
	ExternalResourceType^ get ();
}
static member Image : ExternalResourceType with get
Property Value
ExternalResourceType
See Also
Reference
ExternalResourceTypes.BuiltInExternalResourceTypes Class
Autodesk.Revit.DB Namespace